# 1. Import the libraries

In [1]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.neural_network import MLPClassifier

# 2. Import the dataset

In [2]:
train_data = pd.read_csv('train.csv')
test_data = pd.read_csv('test.csv')

In [3]:
train_data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [4]:
test_data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

# 3. EDA

In [5]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [6]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            367 non-null    object
 1   Gender             356 non-null    object
 2   Married            367 non-null    object
 3   Dependents         357 non-null    object
 4   Education          367 non-null    object
 5   Self_Employed      344 non-null    object
 6   ApplicantIncome    367 non-null    int64
 7   CoapplicantIncome  367 non-null    int64
 8   LoanAmount         362 non-null    float64
 9   Loan_Amount_Term   361 non-null    float64
 10  Credit_History     338 non-null    float64
 11  Property_Area      367 non-null    object
dtypes: float64(3), int64(2), object(7)
memory usage: 34.5+ KB

In [7]:
train_data.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [8]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            367 non-null    object
 1   Gender             356 non-null    object
 2   Married            367 non-null    object
 3   Dependents         357 non-null    object
 4   Education          367 non-null    object
 5   Self_Employed      344 non-null    object
 6   ApplicantIncome    367 non-null    int64
 7   CoapplicantIncome  367 non-null    int64
 8   LoanAmount         362 non-null    float64
 9   Loan_Amount_Term   361 non-null    float64
 10  Credit_History     338 non-null    float64
 11  Property_Area      367 non-null    object
dtypes: float64(3), int64(2), object(7)
memory usage: 34.5+ KB

# 4. Preparing the data

In [9]:
xtrain = train_data.drop(['Loan_ID','Loan_Status'], axis=1)
ytrain = train_data['Loan_Status']

In [10]:
xtrain.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban
1,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural
2,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban
3,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban
4,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban

In [11]:
ytrain.head()

0    Y
1    N
2    Y
3    Y
4    Y
Name: Loan_Status, dtype: object

In [12]:
xtrain.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             601 non-null    object
 1   Married            611 non-null    object
 2   Dependents         599 non-null    object
 3   Education          614 non-null    object
 4   Self_Employed      582 non-null    object
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         592 non-null    float64
 8   Loan_Amount_Term   600 non-null    float64
 9   Credit_History     564 non-null    float64
 10  Property_Area      614 non-null    object
dtypes: float64(4), int64(1), object(6)
memory usage: 52.9+ KB

In [13]:
def convertColumnsToNumeric(data):
    for column in data.columns:
        if data[column].dtype == 'object':
            data[column] = pd.Categorical(data[column]).codes

In [14]:
from statistics import mean
def replaceContinuousMissingValues(data, columns):
    for column in columns:
        avg = mean(data[column].dropna())
        print('Average :: ', avg)
        data[column].fillna(avg, inplace=True)

In [15]:
convertColumnsToNumeric(xtrain)

In [19]:
xtrain.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,1,0,0,0,0,5849,0.0,146.412162,360.0,1.0,2
1,1,1,1,0,0,4583,1508.0,128.000000,360.0,1.0,0
2,1,1,0,0,1,3000,0.0,66.000000,360.0,1.0,2
3,1,1,0,1,0,2583,2358.0,120.000000,360.0,1.0,2
4,1,0,0,0,0,6000,0.0,141.000000,360.0,1.0,2

In [20]:
xtrain.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    int8
 1   Married            614 non-null    int8
 2   Dependents         614 non-null    int8
 3   Education          614 non-null    int8
 4   Self_Employed      614 non-null    int8
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         614 non-null    float64
 8   Loan_Amount_Term   600 non-null    float64
 9   Credit_History     564 non-null    float64
 10  Property_Area      614 non-null    int8
dtypes: float64(4), int64(1), int8(6)
memory usage: 27.7 KB

In [16]:
xtrain.describe()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
count,614.000000,614.000000,614.000000,614.000000,614.000000,614.000000,614.000000,592.000000,600.00000,564.000000,614.000000
mean,0.775244,0.643322,0.719870,0.218241,0.081433,5403.459283,1621.245798,146.412162,342.00000,0.842199,1.037459
std,0.465767,0.489511,1.039056,0.413389,0.423472,6109.041673,2926.248369,85.587325,65.12041,0.364878,0.787482
min,-1.000000,-1.000000,-1.000000,0.000000,-1.000000,150.000000,0.000000,9.000000,12.00000,0.000000,0.000000
25%,1.000000,0.000000,0.000000,0.000000,0.000000,2877.500000,0.000000,100.000000,360.00000,1.000000,0.000000
50%,1.000000,1.000000,0.000000,0.000000,0.000000,3812.500000,1188.500000,128.000000,360.00000,1.000000,1.000000
75%,1.000000,1.000000,1.000000,0.000000,0.000000,5795.000000,2297.250000,168.000000,360.00000,1.000000,2.000000
max,1.000000,1.000000,3.000000,1.000000,1.000000,81000.000000,41667.000000,700.000000,480.00000,1.000000,2.000000

In [17]:
replaceContinuousMissingValues(xtrain, ['LoanAmount'])

Average ::  146.41216216216216

In [18]:
xtrain['LoanAmount']

0      146.412162
1      128.000000
2       66.000000
3      120.000000
4      141.000000
          ...
609     71.000000
610     40.000000
611    253.000000
612    187.000000
613    133.000000
Name: LoanAmount, Length: 614, dtype: float64

In [135]:
from statistics import mode
def replacingCategoricalMissingValues(data, columns):
    for column in columns:
        mod = mode(data[column].dropna())
        data[column].fillna(mod, inplace=True)

In [137]:
replacingCategoricalMissingValues(xtrain, ['Loan_Amount_Term', 'Credit_History', 'Property_Area'])

In [138]:
xtrain.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             614 non-null    int8
 1   Married            614 non-null    int8
 2   Dependents         614 non-null    int8
 3   Education          614 non-null    int8
 4   Self_Employed      614 non-null    int8
 5   ApplicantIncome    614 non-null    int64
 6   CoapplicantIncome  614 non-null    float64
 7   LoanAmount         614 non-null    float64
 8   Loan_Amount_Term   614 non-null    float64
 9   Credit_History     614 non-null    float64
 10  Property_Area      614 non-null    int8
dtypes: float64(4), int64(1), int8(6)
memory usage: 27.7 KB

In [139]:
xtest = test_data.drop('Loan_ID', axis=1)

In [140]:
xtest.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [141]:
convertColumnsToNumeric(xtest)

In [143]:
replaceContinuousMissingValues(xtest, ['LoanAmount'])

Average ::  136.13259668508286

In [144]:
replacingCategoricalMissingValues(xtest, ['Loan_Amount_Term', 'Credit_History', 'Property_Area'])

In [146]:
xtest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             367 non-null    int8
 1   Married            367 non-null    int8
 2   Dependents         367 non-null    int8
 3   Education          367 non-null    int8
 4   Self_Employed      367 non-null    int8
 5   ApplicantIncome    367 non-null    int64
 6   CoapplicantIncome  367 non-null    int64
 7   LoanAmount         367 non-null    float64
 8   Loan_Amount_Term   367 non-null    float64
 9   Credit_History     367 non-null    float64
 10  Property_Area      367 non-null    int8
dtypes: float64(3), int64(2), int8(6)
memory usage: 16.6 KB

In [147]:
dtc = DecisionTreeClassifier()

In [149]:
dtc.fit(xtrain,ytrain)

DecisionTreeClassifier()

In [153]:
ytrain_predict = dtc.predict(xtrain)

In [154]:
from sklearn.metrics import classification_report
print(classification_report(ytrain, ytrain_predict))

              precision    recall  f1-score   support

           N       1.00      1.00      1.00       192
           Y       1.00      1.00      1.00       422

    accuracy                           1.00       614
   macro avg       1.00      1.00      1.00       614
weighted avg       1.00      1.00      1.00       614

In [169]:
ytest_predict = pd.DataFrame(dtc.predict(xtest))

In [170]:
result = pd.DataFrame(test_data['Loan_ID'])

In [171]:
result.head()

    Loan_ID
0  LP001015
1  LP001022
2  LP001031
3  LP001035
4  LP001051

In [178]:
result = pd.concat([result,ytest_predict],axis=1)

In [184]:
result.to_csv('submission.csv',header=['Loan_ID','Loan_Status'], index=False)

# Using RandomForestClassifier

In [185]:
rfc = RandomForestClassifier()

In [186]:
rfc.fit(xtrain,ytrain)

RandomForestClassifier()

In [187]:
ytrain_predict = rfc.predict(xtrain)

In [188]:
print(classification_report(ytrain, ytrain_predict))

              precision    recall  f1-score   support

           N       1.00      1.00      1.00       192
           Y       1.00      1.00      1.00       422

    accuracy                           1.00       614
   macro avg       1.00      1.00      1.00       614
weighted avg       1.00      1.00      1.00       614

In [189]:
ytest_predict = rfc.predict(xtest)

In [191]:
result = pd.concat([pd.DataFrame(test_data['Loan_ID']),pd.DataFrame(ytest_predict)],axis=1)

In [192]:
result.to_csv('submission.csv',header=['Loan_ID','Loan_Status'], index=False)

# Using Machine Learning Classifier

In [194]:
mlc = MLPClassifier()

In [195]:
mlc.fit(xtrain, ytrain)

MLPClassifier()

In [196]:
ytrain_predict = mlc.predict(xtrain)

In [197]:
print(classification_report(ytrain,ytrain_predict))

              precision    recall  f1-score   support

           N       0.39      0.24      0.30       192
           Y       0.71      0.83      0.76       422

    accuracy                           0.64       614
   macro avg       0.55      0.53      0.53       614
weighted avg       0.61      0.64      0.62       614

In [198]:
ytest_predict = mlc.predict(xtest)

In [199]:
result = pd.concat([pd.DataFrame(test_data['Loan_ID']),pd.DataFrame(ytest_predict)],axis=1)
result.to_csv('submission.csv',header=['Loan_ID','Loan_Status'], index=False)

In [21]:
0.75*0.75+(0.25**2)

0.625